import os

BASE_DIR = os.path.dirname(os.path.abspath(__file__)) 

# Токен Telegram бота
TOKEN = '8028992264:AAEMNsfOSuACUSFYXEP2Hw3FMMssI2wyPrM'

# URL вебхука Битрикс24
BITRIX_WEBHOOK_URL = "https://b24-kzukab.bitrix24.ru/rest/1/yia05gmzs3jbmpnk/"

# Имя пользователя менеджера (для контакта с клиентами)
manager_username = "@menej_tj"

# Сопоставление полей в Битрикс24
BITRIX_FIELDS = {
    "title": "TITLE",
    "type": "TYPE_ID",
    "stage": "STAGE_ID",
    "price": "OPPORTUNITY",
    "phone": "UF_CRM_1740629049",
    "course": "UF_CRM_1740629005",
    "tariff_name": "UF_CRM_1740628975",
    "referral": "UF_CRM_1740629032",
    "call_requested": "UF_CRM_1740886001"
}

# Добавление 5 ответственных менеджеров для каждого курса с их Bitrix ID
courses = {
    "course1": {
        "name": "Wildberries",
        "image": os.path.join(BASE_DIR, "images", "wildberis.jpg"),
        "responsible_managers": [
            {"name": "Бузургхон Бобоев", "bitrix_id": "2241"},
            {"name": "Махмудов Фатхуллоходжа ", "bitrix_id": "4783"},
            {"name": "Давлатбек Ахмедов", "bitrix_id": "5043"},
            {"name": "Нуров Икбол", "bitrix_id": "5557"},
        ],
        "tariffs": {
            "tariff1": {
                "name": "Менеджер", 
                "price": 24900,
                "info": {
                    "ru": "🔹 Тариф <Менеджер>\n\n📌 После обучения сможете работать менеджером на маркетплейсах.\n📌 Возможность вести несколько магазинов и зарабатывать достойные деньги.",
                    "tj": "🔹 Тарифи <Менеҷер>\n\n📌 Пас аз омӯзиш шумо метавонед ҳамчун менеҷер дар маркетплейсҳо кор кунед.\n📌 Имконияти идора кардани якчанд мағоза ва ба даст овардани даромади хуб."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_7m2q3/"
            },
            "tariff2": {
                "name": "VIP", 
                "price": 49900,
                "info": {
                    "ru": "🔹 Тариф <VIP>\n\n🔥 Идеально для тех, кто хочет запустить свой бизнес на Wildberries.\n📍 Онлайн-формат: учитесь из любой точки мира и совмещайте с работой!",
                    "tj": "🔹 Тарифи <VIP>\n\n🔥 Беҳтарин интихоб барои онҳое, ки мехоҳанд тиҷорати худро дар Wildberries оғоз кунанд.\n📍 Формати онлайн: аз ҳар нуқтаи ҷаҳон омӯзед ва бо кор якҷоя кунед!"
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_iuvev/"
            },
            "tariff3": {
                "name": "Наставничество", 
                "price": 84900,
                "info": {
                    "ru": "🔹 Тариф <Наставничество>\n\n🎓 Проходите обучение онлайн и 2 раза в неделю приходите в офис для живого общения с наставником.\n📌 Возможность задать любые вопросы и получить персональные рекомендации.",
                    "tj": "🔹 Тарифи <Роҳбаладӣ>\n\n🎓 Таълими онлайн гиред ва 2 маротиба дар як ҳафта ба офис барои мулоқоти рӯ ба рӯ бо роҳбалад биёед.\n📌 Имконияти пурсидани ҳама гуна саволҳо ва гирифтани тавсияҳои инфиродӣ."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_ajfvs/"
            },
            "tariff4": {
                "name": "Офлайн", 
                "price": 115000,
                "info": {
                    "ru": "🔹 Тариф <Офлайн>\n\n🏢 Включает всё, что в других тарифах, но с 3 очными встречами в офисе с наставником.\n📌 От старта до запуска бизнеса под руководством опытного куратора.",
                    "tj": "🔹 Тарифи <Офлайн>\n\n🏢 Ҳамаи он чизеро, ки дар дигар тарифҳо ҳаст, дар бар мегирад, аммо бо 3 вохӯрии рӯ ба рӯ дар офис бо роҳбалад.\n📌 Аз оғоз то роҳандозии тиҷорат таҳти роҳбарии мураббии ботаҷриба."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_wcuqu/"
            }
        }
    },
    "course2": {
        "name": "OZON",
        "image": os.path.join(BASE_DIR, "images", "ozon.jpg"),
        "responsible_managers": [
            {"name": "Нуралишох Сатторов ", "bitrix_id": "301"},
            {"name": "Юнус Рахимов "      , "bitrix_id": "4977"},
            {"name": "Фирдавс Розиков"    , "bitrix_id": "5289"},
            {"name": "Хусниддин Кабиров " , "bitrix_id": "1793"},
            {"name": "Фуркат Азимов"      , "bitrix_id": "5553"}
        ],
        "tariffs": {
            "tariff1": {
                "name": "Менеджер", 
                "price": 20000,
                "info": {
                    "ru": "🔹 Тариф <Менеджер>\n\n📌 После обучения сможете работать менеджером на маркетплейсах.\n📌 Возможность вести несколько магазинов и зарабатывать достойные деньги.",
                    "tj": "🔹 Тарифи <Менеҷер>\n\n📌 Пас аз омӯзиш шумо метавонед ҳамчун менеҷер дар маркетплейсҳо кор кунед.\n📌 Имконияти идора кардани якчанд мағоза ва ба даст овардани даромади хуб."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_vwygw/"
            },
            "tariff2": {
                "name": "VIP", 
                "price": 34900,
                "info": {
                    "ru": "🔹 Тариф <ВИП>\n\n🔥 Идеально для тех, кто хочет запустить свой бизнес на Ozon.\n📍 Онлайн-формат: учитесь из любой точки мира и совмещайте с работой!",
                    "tj": "🔹 Тарифи <VIP>\n\n🔥 Беҳтарин интихоб барои онҳое, ки мехоҳанд тиҷорати худро дар Ozon оғоз кунанд.\n📍 Формати онлайн: аз ҳар нуқтаи ҷаҳон омӯзед ва бо кор якҷоя кунед!"
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_aq0vp/"
            },
            "tariff3": {
                "name": "Наставничество", 
                "price": 74900,
                "info": {
                    "ru": "🔹 Тариф <Наставничество>\n\n🎓 Проходите обучение онлайн и 2 раза в неделю приходите в офис для живого общения с наставником.\n📌 Возможность задать любые вопросы и получить персональные рекомендации.",
                    "tj": "🔹 Тарифи <Роҳбаладӣ>\n\n🎓 Таълими онлайн гиред ва 2 маротиба дар як ҳафта ба офис барои мулоқоти рӯ ба рӯ бо роҳбалад биёед.\n📌 Имконияти пурсидани ҳама гуна саволҳо ва гирифтани тавсияҳои инфиродӣ."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_vj9gy/"
            },
            "tariff4": {
                "name": "Офлайн", 
                "price": 94900,
                "info": {
                    "ru": "🔹 Тариф <Офлайн>\n\n🏢 Включает всё, что в других тарифах, но с 3 очными встречами в офисе с наставником.\n📌 От старта до запуска бизнеса под руководством опытного куратора.",
                    "tj": "🔹 Тарифи <Офлайн>\n\n🏢 Ҳамаи он чизеро, ки дар дигар тарифҳо ҳаст, дар бар мегирад, аммо бо 3 вохӯрии рӯ ба рӯ дар офис бо роҳбалад.\n📌 Аз оғоз то роҳандозии тиҷорат таҳти роҳбарии мураббии ботаҷриба."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_gcrim/"
            }
        }
    },
    "course3": {
        "name": "AVITO",
        "image": os.path.join(BASE_DIR, "images", "avito.jpg"),
        "responsible_managers": [
            {"name": "Нуралишох Сатторов ", "bitrix_id": "301"},
            {"name": "Юнус Рахимов "      , "bitrix_id": "4977"},
            {"name": "Фирдавс Розиков"    , "bitrix_id": "5289"},
            {"name": "Хусниддин Кабиров " , "bitrix_id": "1793"},
            {"name": "Фуркат Азимов"      , "bitrix_id": "5553"}
        ],
        "tariffs": {
            "tariff1": {
                "name": "Стандарт", 
                "price": 20000,
                "info": {
                    "ru": "🔹 Тариф <Стандарт>\n\n📚 Обучение онлайн.\n📌 Возможность задать любые вопросы и получить персональные рекомендации.",
                    "tj": "🔹 Тарифи <Стандарт>\n\n📚 Таълими онлайн.\n📌 Имконияти пурсидани ҳама гуна саволҳо ва гирифтани тавсияҳои инфиродӣ."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_tdvv4/"
            },
            "tariff2": {
                "name": "Премиум", 
                "price": 30000,
                "info": {
                    "ru": "🔹 Тариф <Премиум>\n\n🏢 Включает всё, что в тарифе <Стандарт>, но с 1 очными встречами в офисе с наставником.\n📌 От старта до запуска бизнеса под руководством опытного куратора.",
                    "tj": "🔹 Тарифи <Премиум>\n\n🏢 Ҳамаи он чизеро, ки дар тарифи <Стандарт> ҳаст, дар бар мегирад, аммо бо 1 вохӯрии рӯ ба рӯ дар офис бо роҳбалад.\n📌 Аз оғоз то роҳандозии тиҷорат таҳти роҳбарии мураббии ботаҷриба."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_kavrj/"
            },
            "tariff3": {
                "name": "Наставничество", 
                "price": 64900,
                "info": {
                    "ru": "🔹 Тариф <Наставничество Avito>\n\n🎓 Обучение + поддержка наставника.\n📌 Проходите онлайн-курс + 2 раза в неделю посещаете офис для живого общения.\n📌 Разбор ошибок, ответы на вопросы и индивидуальные рекомендации.\n📌 Подходит для тех, кто хочет быстро и эффективно освоить Avito.",
                    "tj": "🔹 Тарифи <Роҳбаладии Avito>\n\n🎓 Таълим + дастгирии роҳбалад.\n📌 Курси онлайнро гузаред + 2 маротиба дар як ҳафта ба офис барои суҳбати зинда ташриф оред.\n📌 Таҳлили хатогиҳо, ҷавоб ба саволҳо ва тавсияҳои инфиродӣ.\n📌 Барои онҳое, ки мехоҳанд Avito-ро зуд ва самаранок аз худ кунанд, мувофиқ аст."
                },
                "link": "https://b24-c4qbje.bitrix24site.ru/crm_form_sdeyk/"
            }
        }
    }
}
BITRIX_DEAL_SETTINGS = {
    "title_prefix": "🛒 Покупка курса - ",
    "deal_type": "GOODS",
    "new_stage": "NEW",
    "no_referrer_text": "Нет реферера",
    "call_request_text": "Пожалуйста, позвоните клиенту",
    "no_call_request_text": ""
}